tap "hashicorp/tap", "https://github.com/hashicorp/homebrew-tap", force_auto_update: true
tap "goreleaser/tap", "https://github.com/goreleaser/homebrew-tap", force_auto_update: true
tap "keidarcy/tap", "https://github.com/keidarcy/homebrew-tap", force_auto_update: true
tap "shivammathur/php", "https://github.com/shivammathur/homebrew-php", force_auto_update: true

# casks
cask "1password"
cask "1password-cli"
cask "discord"
cask "ghostty"
cask "goreleaser/tap/goreleaser-pro"
cask "microsoft-teams", greedy: true
cask "microsoft-outlook", greedy: true
cask "mysql-shell"
cask "obs"
cask "session-manager-plugin"
cask "signal"
cask "stats"
cask "visual-studio-code"
cask "whatsapp"

# brews
brew "awscli"
brew "awscurl"
brew "bash"
brew "bat"
brew "blackfireio/homebrew-blackfire/blackfire"
brew "bottom"
brew "buf"
brew "composer"
brew "container"
brew "coreutils"
brew "curl"
brew "docker"
brew "docker-buildx"
brew "docker-completion"
brew "e1s"
brew "eza"
brew "fd"
brew "findutils"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-filter-repo"
brew "gnu-sed"
brew "go"
brew "golangci-lint"
brew "gpg2"
brew "grep"
brew "hashicorp/tap/terraform"
brew "htop"
brew "jq"
brew "k6"
brew "keidarcy/tap/e1s"
brew "lazygit"
brew "libpq", link: true
brew "mysql-client"
brew "nats-io/homebrew-nats-tools/nats"
brew "neovim", args: ["--HEAD"]
brew "node"
brew "p7zip"
brew "php-cs-fixer"
brew "phpstan"
brew "rclone"
brew "ripgrep"
brew "shivammathur/extensions/grpc@8.4"
brew "shivammathur/extensions/opentelemetry@8.4"
brew "shivammathur/extensions/phpredis@8.4"
brew "shivammathur/php/php@8.4", link: :overwrite
brew "temporal"
brew "terragrunt"
brew "tflint"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "unzip"
brew "watch"
brew "wget"
brew "wireguard-go"
brew "wireguard-tools"
brew "zip"
brew "zoxide"
brew "zstd"

# zsh and plugins
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "pure"

# LSPs and tooling for Neovim
brew "buf"
brew "delve"
brew "dockerfile-language-server"
brew "gci"
brew "gofumpt"
brew "goimports"
brew "golines"
brew "gopls"
brew "hadolint"
brew "jsonlint"
brew "lua-language-server"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
brew "yamlfix"
brew "yamllint"
brew "sqlfmt"
brew "hashicorp/tap/terraform-ls"
