tap "hashicorp/tap", "https://github.com/hashicorp/homebrew-tap", force_auto_update: true
tap "goreleaser/tap", "https://github.com/goreleaser/homebrew-tap", force_auto_update: true
tap "keidarcy/tap", "https://github.com/keidarcy/homebrew-tap", force_auto_update: true
tap "shivammathur/php", "https://github.com/shivammathur/homebrew-php", force_auto_update: true
tap "blackfireio/homebrew-blackfire", "https://github.com/blackfireio/homebrew-blackfire", force_auto_update: true
tap "nats-io/homebrew-nats-tools", "https://github.com/nats-io/homebrew-nats-tools", force_auto_update: true

# casks
cask "1password" if OS.mac?
cask "discord" if OS.mac?
cask "ghostty" if OS.mac?
cask "microsoft-teams", greedy: true if OS.mac?
cask "microsoft-outlook", greedy: true if OS.mac?
cask "mysql-shell" if OS.mac?
cask "obs" if OS.mac?
cask "session-manager-plugin" if OS.mac?
cask "signal" if OS.mac?
cask "stats" if OS.mac?
cask "visual-studio-code" if OS.mac?
cask "whatsapp" if OS.mac?
cask "tailscale-app" if OS.mac?
cask "slack" if OS.mac?

cask "1password-cli"
cask "goreleaser/tap/goreleaser-pro"
cask "codex"

# app store apps
mas "Magnet", id: 441258766 if OS.mac?
mas "Infuse", id: 1136220934 if OS.mac?
mas "WireGuard", id: 1451685025 if OS.mac?

# brews
brew "awscli"
brew "awscurl"
brew "bash"
brew "bat"
brew "blackfireio/homebrew-blackfire/blackfire"
brew "bottom"
brew "buf"
brew "composer"
brew "container" if OS.mac?
brew "coreutils"
brew "curl"
brew "docker"
brew "docker-buildx"
brew "docker-completion"
brew "eza"
brew "fd"
brew "findutils"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-filter-repo"
brew "gnu-sed"
brew "go"
brew "golangci-lint"
brew "gpg2"
brew "grep"
brew "hashicorp/tap/terraform"
brew "htop"
brew "jq"
brew "k6"
brew "keidarcy/tap/e1s"
brew "lazygit"
brew "libpq", link: true
brew "mas" if OS.mac?
brew "mysql-client"
brew "nats-io/homebrew-nats-tools/nats"
brew "neovim", args: ["HEAD"]
brew "node"
brew "p7zip"
brew "php-cs-fixer"
brew "phpstan"
brew "rclone"
brew "ripgrep"
brew "shivammathur/php/php@8.4", link: :overwrite, postinstall: "sed -i '' 's,^memory_limit =.*$,memory_limit = 4G,' ${HOMEBREW_PREFIX}/etc/php/8.4/php.ini"
brew "shivammathur/extensions/grpc@8.4"
brew "shivammathur/extensions/opentelemetry@8.4"
brew "shivammathur/extensions/phpredis@8.4"
brew "temporal"
brew "terragrunt"
brew "tflint"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "unzip"
brew "watch"
brew "wget"
brew "wireguard-go"
brew "wireguard-tools"
brew "zip"
brew "zoxide"
brew "zstd"

# zsh and plugins
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "pure"

# LSPs and tooling for Neovim
brew "buf"
brew "delve"
brew "dockerfile-language-server"
brew "gci"
brew "gofumpt"
brew "goimports"
brew "golines"
brew "gopls"
brew "hadolint"
brew "jsonlint"
brew "lua-language-server"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
brew "yamlfix"
brew "yamllint"
brew "sqlfmt"
brew "hashicorp/tap/terraform-ls"
