tap "hashicorp/tap", "https://github.com/hashicorp/homebrew-tap", force_auto_update: true
tap "goreleaser/tap", "https://github.com/goreleaser/homebrew-tap", force_auto_update: true
tap "keidarcy/tap", "https://github.com/keidarcy/homebrew-tap", force_auto_update: true
tap "shivammathur/php", "https://github.com/shivammathur/homebrew-php", force_auto_update: true

# casks
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "discord"
cask "ghostty"
cask "goreleaser/tap/goreleaser-pro"
cask "microsoft-teams", greedy: true
cask "mysql-shell"
cask "obs"
cask "session-manager-plugin"
cask "signal"
cask "stats"
cask "visual-studio-code"
cask "whatsapp"

# brews
brew "awscli"
brew "bash"
brew "bat"
brew "blackfireio/homebrew-blackfire/blackfire"
brew "bottom"
brew "buf"
brew "composer"
brew "coreutils"
brew "curl"
brew "docker"
brew "docker-buildx"
brew "docker-completion"
brew "eza"
brew "fd"
brew "findutils"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "golangci-lint"
brew "gpg2"
brew "grep"
brew "hashicorp/tap/terraform"
brew "htop"
brew "janbuecker/custom/gci"
brew "jq"
brew "keidarcy/tap/e1s"
brew "lazygit"
brew "libpq", link: true
brew "mysql-client"
brew "nats-io/homebrew-nats-tools/nats"
brew "neovim", args: ["--HEAD"]
brew "node"
brew "p7zip"
brew "php-cs-fixer"
brew "phpstan"
brew "rclone"
brew "ripgrep"
brew "shivammathur/extensions/grpc@8.4"
brew "shivammathur/extensions/opentelemetry@8.4"
brew "shivammathur/extensions/redis@8.4"
brew "shivammathur/php/php@8.4", link: :overwrite
brew "temporal"
brew "terragrunt"
brew "tflint"
brew "tldr"
brew "tree-sitter-cli"
brew "tmux"
brew "unzip"
brew "wakeonlan"
brew "wget"
brew "wireguard-go"
brew "wireguard-tools"
brew "zip"
brew "zstd"
brew "zoxide"

# zsh and plugins
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "pure"
